{
  "be": [],
  "fr": [],
  "ma": [
    {
      "id": "Q57553",
      "name": "Mohammed None",
      "wikipedia_url": "https://ar.wikipedia.org/wiki/%D9%85%D8%AD%D9%85%D8%AF_%D8%A7%D9%84%D8%B3%D8%A7%D8%AF%D8%B3_%D8%A8%D9%86_%D8%A7%D9%84%D8%AD%D8%B3%D9%86",
      "first_paragraph": "مُحمد السادس بن الحسن الثاني العلوي (مواليد 21 أغسطس 1963) هو ملك المملكة المغربية منذ عام 1999 والملك الثالث والعشرون للمغرب من سلالة العلويين الفيلاليين، تولى الحكم خلفًا لوالده الملك الحسن الثاني بعد وفاته، وبويع ملكًا يوم الجمعة 9 ربيع الثاني سنة 1420 هـ الموافق 23 يوليو 1999 بالقصر الملكي بالرباط."
    },
    {
      "id": "Q69103",
      "name": "Hassan None",
      "wikipedia_url": "https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D8%AD%D8%B3%D9%86_%D8%A7%D9%84%D8%AB%D8%A7%D9%86%D9%8A_%D8%A8%D9%86_%D9%85%D8%AD%D9%85%D8%AF",
      "first_paragraph": "الحَسَن الثاني بِنْ مُحمد بِنْ يوسف العَلوي (9 يوليو 1929 – 23 يوليو 1999)،[12] ثاني ملوك المملكة المغربية بعد الإستقلال، والملك الثاني والعشرين للمغرب من سلالة العلويين الفيلاليين، تولى حكم المملكة المغربية خلفًا لوالده الملك محمد الخامس في 26 فبراير 1961 وحتى وفاته في 23 يوليو 1999. ينتمي الملك الحسن الثاني إلى السلالة العلوية التي تعود في نسبها إلى الحسن بن علي بن أبي طالب، وتحكم المغرب منذ عام 1666 ميلادية ويلقب الحاكم منهم بأمير المؤمنين."
    },
    {
      "id": "Q193874",
      "name": "Mohammed None",
      "wikipedia_url": "https://ar.wikipedia.org/wiki/%D9%85%D8%AD%D9%85%D8%AF_%D8%A7%D9%84%D8%AE%D8%A7%D9%85%D8%B3_%D8%A8%D9%86_%D9%8A%D9%88%D8%B3%D9%81",
      "first_paragraph": "محمد الخامس بن يوسف بن الحسن بن محمد بن عبد الرحمن بن هشام بن محمد بن عبد الله بن إسماعيل بن إسماعيل بن الشريف بن علي العلوي وُلد (1327 هـ / 10 أغسطس 1909م بالقصر السلطاني بفاس) [1] وتوفي (1381 هـ / 26 فبراير 1961م بالرباط) خَلَف والده السلطان مولاي يوسف الذي توفي بُكرة يوم الخميس 22 جمادى الأولى سنة 1346 هـ موافق 17 نوفمبر سنة 1927م[2] فبويع ابنه سيدي محمد سلطانا للمغرب في اليوم الموالي بعد صلاة الجمعة 23 جمادى الأولى سنة 1346 هـ موافق 18 نوفمبر سنة 1927م في القصر السلطاني بفاس [3] ولم يزل سلطان المغرب إلى سنة 1957م، قضى منها المنفى بين (1953-1955)، ثم اتخذ لقب الملك سنة 1957م ولم يزل ملكا إلى وفاته سنة 1961م، ساند السلطان محمد الخامس نضالات الحركة الوطنية المغربية المطالبة بتحقيق الاستقلال، الشيء الذي دفعه إلى الاصطدام بسلطات الحماية. وكانت النتيجة قيام سلطات الحماية بنفيه إلى مدغشقر. وعلى إثر ذلك اندلعت مظاهرات مطالبة بعودته إلى وطنه. وأمام اشتداد حدة المظاهرات، قبلت السلطات الفرنسية بإرجاع السلطان إلى عرشه يوم 16 نوفمبر 1955. وبعد بضعة شهور تم إعلان استقلال المغرب. كان الملك محمد الخامس يكنى: أبا عبد الله.[1][4]"
    },
    {
      "id": "Q334782",
      "name": "Mohammed None",
      "wikipedia_url": "https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D9%82%D8%A7%D8%A6%D9%85_%D8%A8%D8%A3%D9%85%D8%B1_%D8%A7%D9%84%D9%84%D9%87_%D8%A7%D9%84%D8%B3%D8%B9%D8%AF%D9%8A",
      "first_paragraph": "أبو عبد الله محمد بن محمد ابن علي بن مخلوف بن زيدان الملقب بالقائم بأمر الله عميد الأسرة السعدية وأول سلطان للمغرب من الأسرة السعدية، حكم بين 1509 - 1517."
    }
  ],
  "ru": [
    {
      "id": "Q7747",
      "name": "Vladimir Putin",
      "wikipedia_url": "https://ru.wikipedia.org/wiki/%D0%9F%D1%83%D1%82%D0%B8%D0%BD,_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87",
      "first_paragraph": "Влади́мир Влади́мирович Пу́тин (род. 7 октября 1952, Ленинград, СССР) — российский государственный и политический деятель. Действующий президент Российской Федерации, председатель Государственного Совета Российской Федерации и Совета Безопасности Российской Федерации; Верховный главнокомандующий Вооружёнными силами Российской Федерации с 7 мая 2012 года. Ранее занимал должность президента с 7 мая 2000 по 7 мая 2008 года, также в 1999—2000 и 2008—2012 годах занимал должность председателя правительства Российской Федерации. Фактически руководит Россией, согласно разным оценкам, с 1999[7] или с 2000 года[8]. В сентябре 2017 года Путин стал самым долго правящим российским лидером после Иосифа Сталина[9][10], а после окончания пятого президентского срока станет таковым со времён Екатерины II[11]."
    },
    {
      "id": "Q23530",
      "name": "Dmitry Medvedev",
      "wikipedia_url": "https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D0%B4%D0%B2%D0%B5%D0%B4%D0%B5%D0%B2,_%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%B8%D0%B9_%D0%90%D0%BD%D0%B0%D1%82%D0%BE%D0%BB%D1%8C%D0%B5%D0%B2%D0%B8%D1%87",
      "first_paragraph": "иностранные:"
    },
    {
      "id": "Q34453",
      "name": "Boris Yeltsin",
      "wikipedia_url": "https://ru.wikipedia.org/wiki/%D0%95%D0%BB%D1%8C%D1%86%D0%B8%D0%BD,_%D0%91%D0%BE%D1%80%D0%B8%D1%81_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B5%D0%B2%D0%B8%D1%87",
      "first_paragraph": "Бори́с Никола́евич Е́льцин (1 февраля 1931 (1931-02-01), Бутка, Буткинский район, Уральская область, РСФСР, СССР — 23 апреля 2007, Москва, Россия) — советский и российский партийный, государственный и политический деятель, первый всенародно избранный Президент Российской Федерации (1991—1999)[⇨]; в ноябре 1991 — июне 1992 года одновременно возглавлял правительство. С марта по май 1992 года исполнял обязанности министра обороны Российской Федерации."
    }
  ],
  "us": [
    {
      "id": "Q23",
      "name": "George Washington",
      "wikipedia_url": "https://en.wikipedia.org/wiki/George_Washington",
      "first_paragraph": "George Washington (February 22, 1732 – December 14, 1799) was an American Founding Father, politician, military officer, and farmer who served as the first president of the United States from 1789 to 1797. Appointed by the Second Continental Congress as commander of the Continental Army in 1775, Washington led Patriot forces to victory in the American Revolutionary War and then served as president of the Constitutional Convention in 1787, which drafted the current Constitution of the United States. Washington has thus become commonly known as the \"Father of his Country\"."
    },
    {
      "id": "Q76",
      "name": "Barack Obama",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Barack_Obama",
      "first_paragraph": "Barack Hussein Obama II[a] (born August 4, 1961) is an American politician who served as the 44th president of the United States from 2009 to 2017. As a member of the Democratic Party, he was the first African-American  president in U.S. history. Obama previously served as a U.S. senator representing Illinois from 2005 to 2008 and as an Illinois state senator from 1997 to 2004."
    },
    {
      "id": "Q91",
      "name": "Abraham Lincoln",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Abraham_Lincoln",
      "first_paragraph": "Abraham Lincoln (/ˈlɪŋkən/ LINK-ən; February 12, 1809 – April 15, 1865) was an American lawyer, politician, and statesman who served as the 16th president of the United States from 1861 until his assassination in 1865. He led the United States through the American Civil War, defending the nation as a constitutional union, defeating the insurgent Confederacy, playing a major role in the abolition of slavery, expanding the power of the federal government, and modernizing the U.S. economy."
    },
    {
      "id": "Q207",
      "name": "George Bush",
      "wikipedia_url": "https://en.wikipedia.org/wiki/George_W._Bush",
      "first_paragraph": "George Walker Bush[a] (born July 6, 1946) is an American politician and businessman who served as the 43rd president of the United States from 2001 to 2009. A member of the Republican Party, he also served as the 46th governor of Texas from 1995 to 2000."
    },
    {
      "id": "Q1124",
      "name": "Bill Clinton",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Clinton",
      "first_paragraph": "William Jefferson  Clinton (né Blythe; born August 19, 1946) is an American lawyer and politician  who served as the 42nd president of the United States from 1993 to 2001. A member of the Democratic Party, he previously served as governor of Arkansas from 1979 to 1981 and again from 1983 to 1992. Clinton, whose policies reflected a centrist \"Third Way\" political philosophy, became known as a New Democrat."
    },
    {
      "id": "Q6279",
      "name": "Joe Biden",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Biden",
      "first_paragraph": "Joseph Robinette Biden Jr.[b] (born November 20, 1942) is an American politician who has been the 46th and current president of the United States since 2021. A member of the Democratic Party, he served as the 47th vice president from 2009 to 2017 under President Barack Obama and represented Delaware in the U.S. Senate from 1973 to 2009."
    },
    {
      "id": "Q8007",
      "name": "Franklin Roosevelt",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Franklin_D._Roosevelt",
      "first_paragraph": "Franklin Delano Roosevelt[a] (January 30, 1882 – April 12, 1945), commonly known by his initials FDR, was an American politician who served as the 32nd president of the United States from 1933 until his death in 1945. The longest serving U.S. president, he is the only president to have served more than two terms. His initial two terms were centered on combating the Great Depression, while his third and fourth saw him shift his focus to America's involvement in World War II."
    },
    {
      "id": "Q8612",
      "name": "Andrew Johnson",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Johnson",
      "first_paragraph": "Andrew Johnson (December 29, 1808 – July 31, 1875) was the 17th president of the United States, serving from 1865 to 1869. He assumed the presidency following the assassination of Abraham Lincoln, as he was vice president at that time. Johnson was a Democrat who ran with Abraham Lincoln on the National Union Party ticket, coming to office as the Civil War concluded. He favored quick restoration of the seceded states to the Union without protection for the newly freed people who were formerly enslaved as well as pardoning ex-Confederates. This led to conflict with the Republican-dominated Congress, culminating in his impeachment by the House of Representatives in 1868. He was acquitted in the Senate by one vote."
    },
    {
      "id": "Q9582",
      "name": "Gerald Ford",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Gerald_Ford",
      "first_paragraph": "Gerald Rudolph Ford Jr.[a] (born Leslie Lynch King Jr.; July 14, 1913 – December 26, 2006) was an American politician who served as the 38th president of the United States from 1974 to 1977. He previously served as the leader of the Republican Party in the U.S. House of Representatives from 1965 to 1973, and as the 40th vice president under President Richard Nixon from 1973 to 1974. Ford succeeded to the presidency when Nixon resigned in 1974, but was defeated for election to a full term in 1976. Ford remains the only person to serve as president without winning an election for president or vice president."
    },
    {
      "id": "Q9588",
      "name": "Richard Nixon",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Nixon",
      "first_paragraph": "Richard Milhous Nixon (January 9, 1913 – April 22, 1994) was the 37th president of the United States, serving from 1969 until his resignation in 1974. A member of the Republican Party, he previously served as a representative and senator from California and as the 36th vice president from 1953 to 1961 under President Dwight D. Eisenhower. His presidency saw the reduction of U.S. involvement in the Vietnam War, détente with the Soviet Union and China, the Apollo 11 Moon landing, and the establishment of the Environmental Protection Agency and Occupational Safety and Health Administration. Nixon's second term ended early when he became the only U.S. president to resign from office, as a result of the Watergate scandal."
    },
    {
      "id": "Q9640",
      "name": "Lyndon Johnson",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Lyndon_B._Johnson",
      "first_paragraph": "Lyndon Baines Johnson (/ˈlɪndən ˈbeɪnz/; August 27, 1908 – January 22, 1973), often referred to as LBJ, was an American politician who served as the 36th president of the United States from 1963 to 1969. He became president after the assassination of John F. Kennedy, under whom he had served as the 37th vice president from 1961 to 1963. A Democrat from Texas, Johnson also served as a U.S. representative and U.S. senator."
    },
    {
      "id": "Q9696",
      "name": "John Kennedy",
      "wikipedia_url": "https://en.wikipedia.org/wiki/John_F._Kennedy",
      "first_paragraph": "John Fitzgerald Kennedy (May 29, 1917 – November 22, 1963), often referred to as JFK, was an American politician who served as the 35th president of the United States from 1961 until his assassination in 1963. He was the youngest person elected president.[a] Kennedy served at the height of the Cold War, and the majority of his foreign policy concerned relations with the Soviet Union and Cuba. A Democrat, Kennedy represented Massachusetts in both houses of the United States Congress prior to his presidency."
    },
    {
      "id": "Q9916",
      "name": "Dwight Eisenhower",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Dwight_D._Eisenhower",
      "first_paragraph": "Dwight David Eisenhower (/ˈaɪzənhaʊ.ər/ EYE-zən-how-ər; born David Dwight Eisenhower; October 14, 1890 – March 28, 1969), nicknamed Ike, was an American military officer and statesman who served as the 34th president of the United States from 1953 to 1961. During World War II, he was Supreme Commander of the Allied Expeditionary Force in Europe and achieved the five-star rank as General of the Army. Eisenhower planned and supervised two of the most consequential military campaigns of World War II: Operation Torch in the North Africa campaign in 1942–1943 and the invasion of Normandy in 1944."
    },
    {
      "id": "Q9960",
      "name": "Ronald Reagan",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Ronald_Reagan",
      "first_paragraph": "Ronald Wilson Reagan[a] (February 6, 1911 – June 5, 2004) was an American politician and actor who served as the 40th president of the United States from 1981 to 1989. A member of the Republican Party, he became an important figure in the American conservative movement, and his presidency is known as the Reagan era."
    },
    {
      "id": "Q11613",
      "name": "Harry Truman",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_S._Truman",
      "first_paragraph": "Harry S. Truman  (May 8, 1884 – December 26, 1972) was the 33rd president of the United States, serving from 1945 to 1953. A member of the Democratic Party, he served as a United States senator from Missouri from 1935 to 1945 and briefly in 1945 as the 34th vice president \nunder Franklin D. Roosevelt. Assuming the presidency after Roosevelt's death, Truman implemented the Marshall Plan in the wake of World War II to rebuild the economy of Western Europe and established both the Truman Doctrine and NATO to contain the expansion of Soviet communism. He proposed numerous liberal domestic reforms, but few were enacted by the conservative coalition that dominated Congress."
    },
    {
      "id": "Q11806",
      "name": "John Adams",
      "wikipedia_url": "https://en.wikipedia.org/wiki/John_Adams",
      "first_paragraph": "John Adams (October 30, 1735 – July 4, 1826) was an American statesman, attorney, diplomat, writer, and Founding Father who served as the second president of the United States from 1797 to 1801. Before his presidency, he was a leader of the American Revolution that achieved independence from Great Britain. During the latter part of the Revolutionary War and in the early years of the new nation, he served the U.S. government as a senior diplomat in Europe. Adams was the first person to hold the office of vice president of the United States, serving from 1789 to 1797. He was a dedicated diarist and regularly corresponded with important contemporaries, including his wife and adviser Abigail Adams and his friend and political rival Thomas Jefferson."
    },
    {
      "id": "Q11812",
      "name": "Thomas Jefferson",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Jefferson",
      "first_paragraph": "Thomas Jefferson (April 13, 1743[b] – July 4, 1826) was an American statesman, planter, diplomat, lawyer, architect, philosopher, and Founding Father who served as the third president of the United States from 1801 to 1809.[6] He was the primary author of the Declaration of Independence. Following the American Revolutionary War and before becoming president in 1801, Jefferson was the nation's first U.S. secretary of state under George Washington and then the nation's second vice president under John Adams. Jefferson was a leading proponent of democracy, republicanism, and natural rights, and he produced formative documents and decisions at the state, national, and international levels."
    },
    {
      "id": "Q11813",
      "name": "James Madison",
      "wikipedia_url": "https://en.wikipedia.org/wiki/James_Madison",
      "first_paragraph": "James Madison (March 16, 1751[b] – June 28, 1836) was an American statesman, diplomat, and Founding Father who served as the fourth president of the United States from 1809 to 1817. Madison was popularly acclaimed the \"Father of the Constitution\" for his pivotal role in drafting and promoting the Constitution of the United States and the Bill of Rights."
    },
    {
      "id": "Q11815",
      "name": "James Monroe",
      "wikipedia_url": "https://en.wikipedia.org/wiki/James_Monroe",
      "first_paragraph": "James Monroe (/mənˈroʊ/ mən-ROH; April 28, 1758 – July 4, 1831) was an American statesman, lawyer, diplomat, and Founding Father who served as the fifth president of the United States from 1817 to 1825, a member of the Democratic-Republican Party. He was the last Founding Father to serve as president as well as the last president of the Virginia dynasty. His presidency coincided with the Era of Good Feelings, concluding the First Party System era of American politics. He issued the Monroe Doctrine, a policy of limiting European colonialism in the Americas. Monroe previously served as governor of Virginia, a member of the United States Senate, U.S. ambassador to France and Britain, the seventh secretary of state, and the eighth secretary of war."
    },
    {
      "id": "Q11816",
      "name": "John Adams",
      "wikipedia_url": "https://en.wikipedia.org/wiki/John_Quincy_Adams",
      "first_paragraph": "John Quincy Adams (/ˈkwɪnzi/ ⓘ;[a] July 11, 1767 – February 23, 1848) was the sixth president of the United States, serving from 1825 to 1829. He previously served as the eighth United States secretary of state from 1817 to 1825. During his long diplomatic and political career, Adams served as an ambassador and also as a member of the United States Congress representing Massachusetts in both chambers. He was the eldest son of John Adams, who served as the second president of the United States from 1797 to 1801, and First Lady Abigail Adams. Initially a Federalist like his father, he won election to the presidency as a member of the Democratic-Republican Party, and later, in the mid-1830s, became affiliated with the Whig Party."
    },
    {
      "id": "Q11817",
      "name": "Andrew Jackson",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Jackson",
      "first_paragraph": "Andrew Jackson  (March 15, 1767 – June 8, 1845) was an American lawyer, planter, general, and statesman who served as the seventh president of the United States from 1829 to 1837. Before his presidency, he gained fame as a general in the U.S. Army and served in both houses of the U.S. Congress. Often praised as an advocate for ordinary Americans and for his work in preserving the union of states, Jackson has also been criticized for his racial policies, particularly his treatment of Native Americans."
    },
    {
      "id": "Q11820",
      "name": "Martin Van Buren",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Van_Buren",
      "first_paragraph": "Martin Van Buren (/væn ˈbjʊərən/ van BURE-ən; Dutch: Maarten van Buren [ˈmaːrtə(n) vɑm‿ˈbyːrə(n)] ⓘ; December 5, 1782 – July 24, 1862) was the eighth president of the United States, serving from 1837 to 1841. A primary founder of the Democratic Party, he served as New York's attorney general and U.S. senator, then briefly as the ninth governor of New York before joining Andrew Jackson's administration as the tenth United States secretary of state, minister to Great Britain, and ultimately the eighth vice president from 1833 to 1837, after being elected on Jackson's ticket in 1832. Van Buren won the presidency in 1836 against divided Whig opponents. Van Buren lost re-election in 1840, and failed to win the Democratic nomination in 1844. Later in his life, Van Buren emerged as an elder statesman and an anti-slavery leader who led the Free Soil Party ticket in the 1848 presidential election."
    },
    {
      "id": "Q11869",
      "name": "William Harrison",
      "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Harrison",
      "first_paragraph": "William Henry Harrison (February 9, 1773 – April 4, 1841) was an American military officer and politician who served as the ninth president of the United States from March 4 to April 4, 1841, the shortest presidency in U.S. history. He was also the first U.S. president to die in office, causing a brief constitutional crisis since presidential succession was not then fully defined in the U.S. Constitution. Harrison was the last president born as a British subject in the Thirteen Colonies and was the grandfather of Benjamin Harrison, the 23rd U.S. president."
    },
    {
      "id": "Q11881",
      "name": "John Tyler",
      "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tyler",
      "first_paragraph": "John Tyler (March 29, 1790 – January 18, 1862) was the tenth president of the United States, serving from 1841 to 1845, after briefly holding office as the tenth vice president in 1841. He was elected vice president on the 1840 Whig ticket with President William Henry Harrison, succeeding to the presidency following Harrison's death 31 days after assuming office. Tyler was a stalwart supporter and advocate of states' rights, including regarding slavery, and he adopted nationalistic policies as president only when they did not infringe on the states' powers. His unexpected rise to the presidency posed a threat to the presidential ambitions of Henry Clay and other Whig politicians and left Tyler estranged from both of the nation's major political parties at the time."
    },
    {
      "id": "Q11891",
      "name": "James Polk",
      "wikipedia_url": "https://en.wikipedia.org/wiki/James_K._Polk",
      "first_paragraph": "James Knox Polk (/poʊk/;[1] November 2, 1795 – June 15, 1849) was the 11th president of the United States, serving from 1845 to 1849. He also served as the 13th speaker of the House of Representatives from 1835 to 1839 and the ninth governor of Tennessee from 1839 to 1841. A protégé of Andrew Jackson, he was a member of the Democratic Party and an advocate of Jacksonian democracy. Polk is known for extending the territory of the United States through the Mexican–American War during his presidency, annexing the Republic of Texas, the Oregon Territory, and the Mexican Cession after winning the Mexican–American War."
    },
    {
      "id": "Q11896",
      "name": "Zachary Taylor",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Zachary_Taylor",
      "first_paragraph": "Zachary Taylor (November 24, 1784 – July 9, 1850) was the 12th president of the United States, serving from 1849 until his death in 1850. Taylor was a career officer in the United States Army, rising to the rank of major general and becoming a national hero for his victories in the Mexican–American War. As a result, he won election to the White House despite his vague political beliefs. His top priority as president was to preserve the Union. He died 16 months into his term from a stomach disease. Taylor had the third-shortest presidential term in U.S. history."
    },
    {
      "id": "Q12306",
      "name": "Millard Fillmore",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Millard_Fillmore",
      "first_paragraph": "Millard Fillmore (January 7, 1800 – March 8, 1874) was the 13th president of the United States, serving from 1850 to 1853, and was the last president to have been a member of the Whig Party while in office. A former member of the U.S. House of Representatives, Fillmore was elected the 12th vice president in 1848, and succeeded to the presidency when Zachary Taylor died in July 1850. Fillmore was instrumental in passing the Compromise of 1850, which led to a brief truce in the battle over the expansion of slavery."
    },
    {
      "id": "Q12312",
      "name": "Franklin Pierce",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Franklin_Pierce",
      "first_paragraph": "Franklin Pierce (November 23, 1804 – October 8, 1869) was the 14th president of the United States, serving from 1853 to 1857. A northern Democrat who believed that the abolitionist movement was a fundamental threat to the nation's unity, he alienated anti-slavery groups by signing the Kansas–Nebraska Act and enforcing the Fugitive Slave Act. Conflict between North and South continued after Pierce's presidency, and, after Abraham Lincoln was elected president in 1860, the Southern states seceded, resulting in the American Civil War."
    },
    {
      "id": "Q12325",
      "name": "James Buchanan",
      "wikipedia_url": "https://en.wikipedia.org/wiki/James_Buchanan",
      "first_paragraph": "James Buchanan Jr. (/bjuːˈkænən/ bew-KAN-ən;[3] April 23, 1791 – June 1, 1868) was the 15th president of the United States, serving from 1857 to 1861. Buchanan also served as the secretary of state from 1845 to 1849 and represented Pennsylvania in both houses of the U.S. Congress. He was an advocate for states' rights, particularly regarding slavery, and minimized the role of the federal government preceding the Civil War."
    },
    {
      "id": "Q22686",
      "name": "Donald Trump",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Donald_Trump",
      "first_paragraph": "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who served as the 45th president of the United States from 2017 to 2021."
    },
    {
      "id": "Q23505",
      "name": "George Bush",
      "wikipedia_url": "https://en.wikipedia.org/wiki/George_H._W._Bush",
      "first_paragraph": "George Herbert Walker Bush[a] (June 12, 1924 – November 30, 2018) was an American politician, diplomat, and businessman who served as the 41st president of the United States from 1989 to 1993. A member of the Republican Party, he also served as the 43rd vice president from 1981 to 1989 under Ronald Reagan and previously in various other federal positions.[2]"
    },
    {
      "id": "Q23685",
      "name": "Jimmy Carter",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Carter",
      "first_paragraph": "James Earl Carter Jr. (born October 1, 1924) is an American politician and humanitarian who served as the 39th president of the United States from 1977 to 1981. A member of the Democratic Party, he was the 76th governor of Georgia from 1971 to 1975, and a Georgia state senator from 1963 to 1967. Carter is the longest-lived president in U.S. history and the first to live to 100 years of age."
    },
    {
      "id": "Q33866",
      "name": "Theodore Roosevelt",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Theodore_Roosevelt",
      "first_paragraph": "Theodore  Roosevelt Jr.[b] (October 27, 1858 – January 6, 1919), often referred to as Teddy or T. R., was an American politician, soldier, conservationist, historian, naturalist, explorer and writer who served as the 26th president of the United States from 1901 to 1909. He previously was involved in New York politics, including serving as the state's 33rd governor for two years. He was the vice president under President William McKinley for six months in 1901, assuming the presidency after McKinley's assassination. As president, Roosevelt emerged as a leader of the Republican Party and became a driving force for anti-trust and Progressive policies."
    },
    {
      "id": "Q34296",
      "name": "Woodrow Wilson",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Woodrow_Wilson",
      "first_paragraph": "Thomas Woodrow Wilson (December 28, 1856 – February 3, 1924) was an American politician and academic who served as the 28th president of the United States from 1913 to 1921. He was a progressive Democrat who previously served as the governor of New Jersey from 1911 to 1913 and as the president of Princeton University from 1902 to 1910. As president, Wilson changed the nation's economic policies and led the United States into World War I. He was the leading architect of the League of Nations, and his progressive stance on foreign policy came to be known as Wilsonianism."
    },
    {
      "id": "Q34597",
      "name": "James Garfield",
      "wikipedia_url": "https://en.wikipedia.org/wiki/James_A._Garfield",
      "first_paragraph": "James Abram Garfield (November 19, 1831 – September 19, 1881) was the 20th president of the United States, serving from March 1881 until his assassination in September that year. A preacher, lawyer, and Civil War general, Garfield served nine terms in the United States House of Representatives and is the only sitting member of the House to be elected president. Before his candidacy for the presidency, he had been elected to the U.S. Senate by the Ohio General Assembly—a position he declined when he became president-elect."
    },
    {
      "id": "Q34836",
      "name": "Ulysses Grant",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Ulysses_S._Grant",
      "first_paragraph": "Ulysses S. Grant (born Hiram Ulysses Grant;[b] April 27, 1822 – July 23, 1885) was the 18th president of the United States, serving from 1869 to 1877. As commanding general, Grant led the Union Army to victory in the American Civil War in 1865."
    },
    {
      "id": "Q35041",
      "name": "William McKinley",
      "wikipedia_url": "https://en.wikipedia.org/wiki/William_McKinley",
      "first_paragraph": "William McKinley (January 29, 1843 – September 14, 1901) was the 25th president of the United States, serving from 1897 until his assassination in 1901. A member of the Republican Party, he led a realignment that made Republicans largely dominant in the industrial states and nationwide for decades. He presided over victory in the Spanish–American War of 1898; gained control of Hawaii, Puerto Rico, Guam, and the Philippines; restored prosperity after a deep depression; rejected the inflationary monetary policy of free silver, keeping the nation on the gold standard; and raised protective tariffs."
    },
    {
      "id": "Q35171",
      "name": "Stephen Cleveland",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Grover_Cleveland",
      "first_paragraph": "Stephen Grover Cleveland (March 18, 1837 – June 24, 1908) served as the 22nd and 24th president of the United States from 1885 to 1889 and from 1893 to 1897. He was the first Democrat to win the presidency after the Civil War and was one of two Democratic presidents, followed by Woodrow Wilson, in an era when Republicans dominated the presidency between 1869 and 1933. Cleveland won the popular vote in three presidential elections—1884, 1888,[b] and 1892—and is the only U.S. president to serve non-consecutive presidential terms.[c]"
    },
    {
      "id": "Q35236",
      "name": "Herbert Hoover",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Hoover",
      "first_paragraph": "Herbert Clark Hoover (August 10, 1874 – October 20, 1964) was the 31st president of the United States, serving from 1929 to 1933. He was a member of the Republican Party, and held office during the onset of the Great Depression. A wealthy mining engineer before his presidency, Hoover led the wartime Commission for Relief in Belgium and was the director of the U.S. Food Administration, followed by post-war relief of Europe. In the 1920s, he served as the U.S. Secretary of Commerce."
    },
    {
      "id": "Q35286",
      "name": "Warren Harding",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Warren_G._Harding",
      "first_paragraph": "Warren Gamaliel Harding (November 2, 1865 – August 2, 1923) was the 29th president of the United States, serving from 1921 until his death in 1923. A member of the Republican Party, he was one of the most popular sitting U.S. presidents while in office. After his death, a number of scandals were exposed, including Teapot Dome, as well as an extramarital affair with Nan Britton, which tarnished his reputation."
    },
    {
      "id": "Q35498",
      "name": "Chester Arthur",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Chester_A._Arthur",
      "first_paragraph": "Chester Alan Arthur (October 5, 1829[b] – November 18, 1886) was the 21st president of the United States, serving from 1881 to 1885. He was a Republican lawyer from New York who briefly served as the 20th vice president under President James A. Garfield. Assuming the presidency after Garfield's death, Arthur served the remainder of the term until March 4, 1885."
    },
    {
      "id": "Q35648",
      "name": "William Taft",
      "wikipedia_url": "https://en.wikipedia.org/wiki/William_Howard_Taft",
      "first_paragraph": "Defunct"
    },
    {
      "id": "Q35678",
      "name": "Benjamin Harrison",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Harrison",
      "first_paragraph": "Benjamin Harrison (August 20, 1833 – March 13, 1901) was  the 23rd president of the United States, serving from 1889 to 1893. He was a member of the Harrison family of Virginia—a grandson of the ninth president, William Henry Harrison, and a great-grandson of Benjamin Harrison V, a Founding Father. A Union Army veteran and a Republican, he defeated incumbent Grover Cleveland to win the presidency."
    },
    {
      "id": "Q35686",
      "name": "Rutherford Hayes",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Rutherford_B._Hayes",
      "first_paragraph": "Rutherford Birchard Hayes (/ˈrʌðərfərd/ ⓘ; October 4, 1822 – January 17, 1893) was the 19th president of the United States, serving from 1877 to 1881."
    },
    {
      "id": "Q36023",
      "name": "John Coolidge",
      "wikipedia_url": "https://en.wikipedia.org/wiki/Calvin_Coolidge",
      "first_paragraph": "Calvin Coolidge (born John Calvin Coolidge Jr.[1] /ˈkuːlɪdʒ/ KOOL-ij; July 4, 1872 – January 5, 1933) was the 30th president of the United States, serving from 1923 to 1929. Born in Vermont, Coolidge was a Republican lawyer who climbed the ladder of Massachusetts politics, becoming the state's 48th governor. His prompt and effective response to the Boston police strike of 1919 thrust him into the national spotlight as a man of decisive action. The next year, Coolidge was elected the country's 29th vice president and succeeded to the presidency upon the sudden death of President Warren G. Harding in August 1923. Elected in his own right in 1924, Coolidge gained a reputation as a small-government conservative with a taciturn personality and dry sense of humor that earned him the nickname \"Silent Cal\". His widespread popularity enabled him to run for a second full term, but Coolidge chose not to run again in 1928, remarking that ten years as president would be \"longer than any other man has had it—too long!\"[b]"
    }
  ]
}